import React from 'react';
import Accordion from "../Accordion/Accordion";

const PrivacyPolicy = () => {
    return (
        <div className={'container mx-auto p-8'}>
            <div className={'p-4'}>
                <h3 className={'font-semibold mb-5 capitalize text-lg text-center'}>ҮЙЛЧИЛГЭЭНИЙ НӨХЦӨЛ, НУУЦЛАЛЫН БОДЛОГО</h3>
                <p className={'mb-4 text-justify text-[#151515]'}>
                    Энэхүү Нууцлалын бодлого нь “ТEO” ХХК (цаашид “Бид” гэх) нь Харилцагч та (цаашид “Та” гэх)-нд “NOTLY/НОТОЛЪЁ” үйлчилгээг Үйлчилгээний нөхцөлийн дагуу үзүүлэхтэй
                    холбоотойгоор Таны мэдээллийг хадгалах, бусдад илгээх үйлдэлтэй холбогдон үүсэх харилцааг зохицуулах баримт бичиг болно.
                </p>
                <p className={'mb-4 text-justify'}>
                    Энд бичигдсэн Нууцлалын бодлого нь Үйлчилгээний нөхцөлийн хамтаар Таны болон notly.mn вэбсайт, гар утасны аппликейшн ашиглаж буй бусад хэрэглэгчдийн блокчэйн технологид
                    суурилан баталгаажсан баримт бичгийг хадгалах, илгээх болон нууцлалыг хангахтай холбоотой харилцааг зохицуулах тул анхааралтай уншиж танилцана уу.
                </p>
                <p className={'mb-4 text-justify'}>
                    Та notly.mn вэбсайт, гар утасны аппликэйшнд холбогдсон тохиолдолд Таныг энэхүү Нууцлалын бодлого болон түүний хавсралт, шинэчилсэн хувилбарыг хүлээн зөвшөөрсөн гэж үзнэ.
                </p>
            </div>
            <div className={'accordion p-6 pt-2 bg-white shadow rounded-2xl'}>
                <Accordion/>
            </div>
            <div className="grid sm:grid-cols-2 grid-cols-1 gap-6 py-4">
                <div className={'bg-white shadow rounded-2xl py-6 px-8'}>
                    <h3 className={'font-medium my-3 text-base'}>1. Блокчэйн технологид суурилан баримт бичиг баталгаажуулах</h3>
                    <p className={'text-justify'}>
                        Үйлчилгээ үзүүлэгчийн тархмал бүтэцтэй блокчэйны сүлжээнд Баталгаажуулагч нь таны баримт бичгийг баталгаажуулна. Тухайн баримт бичгийг танд цахим шуудангаар эсвэл
                        бусад хэлбэрээр PDF форматаар өгнө. Та уг баталгаажсан баримт бичгийг блокчэйн сүлжээнд хадгалсан эсэхийг шалгахын тулд NOTLY үйлчилгээний платформыг ашиглан шалгах
                        боломжтой.
                    </p>
                </div>
                <div className={'bg-white shadow rounded-2xl py-6 px-8'}>
                    <h3 className={'font-medium mb-3 text-base'}>2. Мэдээллийн нууц</h3>
                    <p className={'text-justify'}>
                        NOTLY үйлчилгээ нь баталгаажсан баримт бичгийн “хэш” хэлбэрийг хадгалж, түүнтэй таарч байгаа эсэхийг шалгадаг ба тухайн баримт бичигт агуулагдах аливаа мэдээллийг
                        хадгалдаггүй буюу блокчэйн сүлжээнд хүний хувийн мэдээлэл байхгүй болно.
                    </p>
                </div>
                <div className={'bg-white shadow rounded-2xl py-6 px-8'}>
                    <h3 className={'font-medium mb-3 text-base'}>3. Баталгаажсан баримт бичгийг илгээх</h3>
                    <p className={'text-justify'}>
                        NOTLY гар утасны аппликейшнийг ашиглахад хэрэглэгчийн бүртгэл хийгдэхгүй бөгөөд утас нээхдээ хэрэглэдэг нууц үгээ ашиглаад орно. Та өөрийн файл дотроосоо аливаа нэг
                        баримт бичгийг сонгоод апп-р дамжуулан блокчэйн сүлжээнд баталгаажсан эсэхийг шалгах боломжтой. Апп-с мөн бусад байгууллага, хувь хүнрүү илгээх бүрэн боломжтой.
                        Илгээсэн баримтыг тухайн хүн яаж ашиглахыг бид хариуцахгүй.
                    </p>
                </div>
                <div className={'bg-white shadow rounded-2xl py-6 px-8'}>
                    <h3 className={'font-medium mb-3 text-base'}>4. Баталгаажсан баримт бичгийг хадгалах хугацаа</h3>
                    <p className={'text-justify'}>
                        Хэрэглэгч баталгаажсан баримт бичгийг NOTLY үйлчилгээний платформыг ашиглан хугацаагүйгээр хадгалах боломжтой. Гэхдээ баталгаажуулагч нь баталгаажуулж буй баримт
                        бичгийн хүчинтэй хугацааг заасан тохиолдолд уг хугацаанд тухайн баримт бичиг “хүчинтэй баримт” гэж харагдах ба хугацаа нь дууссан тохиолдолд “баталгаажсан баримт
                        бичиг” гэж харагдах боловч “хугацаа нь дууссан” гэх мэдээлэл мөн харагдах болно.
                    </p>
                </div>
                <div className={'bg-white shadow rounded-2xl py-6 px-8'}>
                    <h3 className={'font-medium mb-3 text-base'}>5. Баримт бичгийг блокчэйн сүлжээнд шалгах</h3>
                    <p className={'text-justify mb-2'}>
                        Хэрэглэгч нь баримт бичгийн үнэн зөв болохыг таних, таниулах зорилгоор блокчэйн технологийг ашиглан шалгах, шалгуулах боломжтой. Баримт бичгийг NOTLY үйлчилгээний
                        платформоор шалгах үед “Блокчэйн сүлжээнд баталгаажаагүй байна” гэх илэрц гарч ирвэл уг баримт бичиг нь засвар орсон эсвэл өмнө нь блокчэйн сүлжээгээр
                        баталгаажуулаагүй баримт гэдгийг тодорхойлж байгаа болно. Мөн баталгаажсан баримт бичгийн хувилбар болон засвар оруулсан файл “хүчингүй баримт” гэж тооцогдоно.
                        </p>
                        <i className={'text-sm text-gray-700 text-justify'}>Жич: завсар орсон баримт бичиг гэдэгт тухайн баримт бичгийн агуулгыг буюу доторх мэдээллийг өөрчилсөн баримт
                            бичгийг ойлгох бөгөөд файлын нэр өөрчилсөн эсэх нь хамаарахгүй.</i>
                </div>
                <div className={'bg-white shadow rounded-2xl py-6 px-8'}>
                    <h3 className={'font-medium mb-3 text-base'}>6. Холбоос</h3>
                    <p className={'text-justify'}>
                        Энэхүү Нууцлалын бодлого нь зөвхөн www.notly.mn вэбсайтад хамаарах бөгөөд аливаа бусад вэбсайт болон үйлчилгээний холбоост хамааралгүй болно. Бид уг вэбсайт болон
                        үйлчилгээтэй холбоотой аливаа эрх хэрэгжүүлдэггүй бөгөөд тэдгээрийн нууцлалын бодлого болон аливаа бусад үйл ажиллагаатай холбоотой хариуцлагыг хүлээхгүй болно.
                    </p>
                </div>
                <div className={'bg-white shadow rounded-2xl py-6 px-8'}>
                    <h3 className={'font-medium mb-3 text-base'}>7. Нэмэлт өөрчлөлт</h3>
                    <p className={'text-justify'}>
                        “TEO” ХХК нь энэхүү Нууцлалын бодлогод өөрчлөлт, нэмэлт оруулж болох бөгөөд энэ тухай NOTLY үйлчилгээний платформоор дамжуулан Танд мэдэгдэнэ. Уг өөрчлөлтийн
                        талаар мэдээлэл гарснаас хойш 1 /нэг/ өдөр өнгөрсөн тохиолдолд уг нэмэлт, өөрчлөлт нь хүчин төгөлдөр хэрэгжих бөгөөд Та уг нэмэлт өөрчлөлтийг хүлээн зөвшөөрсөнд
                        тооцогдоно. Энэхүү Нууцлалын бодлогын энэ хувилбар нь 2022 оны 11-р сарын 03-ны өдөр батлагдсан болно.
                    </p>
                </div>
                <div className={'bg-white shadow rounded-2xl py-6 px-8'}>
                    <h3 className={'font-medium mb-3 text-base'}>8. Санал хүсэлт гаргах ба холбоо барих</h3>
                    <p className={'text-justify'}>
                        Хэрэв Танд Бидний Нууцлалын бодлоготой холбоотой аливаа санал хүсэлт гомдол байвал www.notly.mn сайт дээрх “Тусламж үйлчилгээ” хэсэгт хандана уу. Бид Таны санал
                        гомдлыг Үйлчилгээний нөхцөлд заасны дагуу шийдвэрлэнэ. Та Бидэнтэй холбогдохдоо өөрийн нэр, цахим хаяг болон “TEO” ХХК Таныг таних, Танд тулгарсан асуудлыг
                        шийдвэрлэхэд шаардлагатай бусад нэмэлт мэдээллийг өгөх шаардлагатай.
                    </p>
                </div>
            </div>
        </div>
    )
}

export default PrivacyPolicy;
