import React, {useState} from 'react';
import AccordionLayout from "./AccordionLayout/AccordionLayout";

const Accordion = () => {
    const [isActive, setIsActive] = useState(true);

    return (
        <div className='flex flex-col justify-center items-center'>
            <AccordionLayout
                title="НЭР ТОМЬЁО"
                isActive={isActive}
                setIsActive={setIsActive}
            >
                <p className={'my-3 pt-2 text-base'}>Нууцлалын бодлогод заасан нэр томьёог дор дурдсан утгаар ойлгож хэрэглэнэ. Үүнд:</p>
                {
                    data.map((item, idx) => (
                        <ul className={'list-circle pl-5'}>
                            <li className={'py-2'}>
                                <b className={'text-base'}>{item.term} </b> {item.paragh}
                            </li>
                        </ul>
                    ))
                }
            </AccordionLayout>
        </div>
    );
};
export default Accordion;

const data = [
    {
        term: 'NOTLY/НОТОЛЪЁ үйлчилгээ',
        paragh: 'гэж баримт бичгийг блокчэйн технологид суурилан баталгаажуулах үйлчилгээ болон баталгаажсан баримт бичгийг хадгалах, илгээх, баталгаажсан эсэхийг шалгах үйлдлийг хийх боломжтой апп, вэбийг;',
    },
    {
        term: 'Үйлчилгээ үзүүлэгч',
        paragh: 'гэж “NOTLY/НОТОЛЪЁ үйлчилгээ” /цаашид үйлчилгээ гэх/-г үзүүлж буй Монгол Улсын хуулийн этгээд “ТЕО” ХХК;',
    },
    {
        term: 'Баталгаажуулагч',
        paragh: 'гэж баримт бичгийн үнэн зөвийг нотлон блокчэйн технологид суурилан баталгаажуулж буй эрх бүхий хуулийн этгээдийг;',
    },
    {
        term: 'Баталгаажуулагчийн нэр',
        paragh: 'гэж баримт бичгийг блокчэйн технологид суурилан баталгаажуулж буй эрх бүхий хуулийн этгээдийн нэрийг;',
    },
    {
        term: 'Хэрэглэгч',
        paragh: 'гэж баримт бичгийг Баталгаажуулагчаар баталгаажуулж, notly апп болон вэб-д хадгалах, бусдад илгээх, блокчэйн технологид суурилан баталгаажсан эсэхийг шалгах үйлдлийг хийж буй хүн, хуулийн этгээдийг;',
    },
    {
        term: 'Баталгаажсан баримт бичиг',
        paragh: 'гэж Баталгаажуулагч блокчэйн сүлжээг ашиглан баталгаажуулсан баримт бичгийг;',
    },
    {
        term: 'Блокчэйн нэр',
        paragh: 'гэж блокчэйн сүлжээний нэр буюу “TEO blockchain”-г;',
    },
    {
        term: 'Хүчинтэй',
        paragh: 'гэж Баталгаажуулагч нь тухайн баримт бичгийн үнэн зөвийг нотолж, блокчэйн технологид суурилан баталгаажуулсныг',
    },
    {
        term: 'Хүчинтэй хугацаа',
        paragh: 'гэж блокчэйн технологид суурилан баталгаажуулж буй баримт бичгийн хүчинтэй хугацааг;',
    },
    {
        term: 'Баталгаажсан огноо',
        paragh: 'гэж Баталгаажуулагч баримт бичгийг блокчэйн сүлжээнд баталгаажуулсан огноог;',
    },
    {
        term: 'Баталгаажуулагч ID',
        paragh: 'гэж тухайн баримт бичгийг блокчэйн сүлжээнд баталгаажуулж буй ID дугаарыг; баталгаажуулсныг;',
    },
    {
        term: 'Гүйлгээний ID',
        paragh: 'гэж блокчэйн сүлжээнд хийгдэж буй гүйлгээний ID дугаарыг. баталгаажуулсныг;',
    },
    {
        term: 'Платформ',
        paragh: 'гэж Компаниас хөгжүүлж, үүсгэн байгуулсан үйлчилгээг Баталгаажуулагч, хэрэглэгчид санал болгож буй вэбсайт, гар утасны аппликейшн, программ хангамжийн системийг;',
    },
    {
        term: 'Платформын интерфэйс',
        paragh: 'гэж Компанийн notly.mn вэбсайт, утасны аппликэйшн дээрх Танд харагдах цонхыг ойлгох бөгөөд Танд Платформтой харилцан үйлдэл хийх боломжийг олгож буй программ хангамжийг;',
    },
];
